#Область ПрограммныйИнтерфейс

// Ищем задание по наименованию через программный интерфейс БСП.
Процедура ВключитьЗаданиеПоНаименованию(НаименованиеЗадания) Экспорт

	Отбор = Новый Структура();
	Отбор.Вставить("Наименование", НаименованиеЗадания);
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Если Задания.Количество() = 1 Тогда
		НашеЗадание = Задания[0];
		ПараметрыЗадания = Новый Структура();
		ПараметрыЗадания.Вставить("Использование", Истина);
		РегламентныеЗаданияСервер.ИзменитьЗадание(НашеЗадание.УникальныйИдентификатор, ПараметрыЗадания);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
