#Область ПрограммныйИнтерфейс

// Загружает файлы через программный интерфейс БСП.
Процедура ЗагрузитьФайлыБсп(ПараметрыЗагрузки) Экспорт

	ФайловаяСистемаКлиент.ЗагрузитьФайлы(ПараметрыЗагрузки);

КонецПроцедуры

// Сохраняет файлы через программный интерфейс БСП.
Процедура СохранитьФайлыБсп(ПараметрыСохранения) Экспорт

	ФайловаяСистемаКлиент.СохранитьФайлы(ПараметрыСохранения);

КонецПроцедуры

// Передаёт адрес на сервер.
Процедура ПередатьАдресНаСервер(АдресВХранилище) Экспорт

	ОповеститьОбИзменении(АдресВХранилище);

КонецПроцедуры

#КонецОбласти
