#Область ПрограммныйИнтерфейс

// Возвращает код основного языка через функцию БСП.
Функция КодОсновногоЯзыка() Экспорт

	Возврат ОбщегоНазначения.КодОсновногоЯзыка();

КонецФункции

// Возвращает коллекцию справочников из метаданных (не основной язык).
Функция СправочникиМетаданных() Экспорт

	Возврат Метаданные.Справочники;

КонецФункции

// Записывает код языка, полученный параметром.
Процедура ЗаписатьКодЯзыка(КодЯзыка) Экспорт

	ЗаписьЖурналаРегистрации("КодЯзыка", УровеньЖурналаРегистрации.Информация, , , КодЯзыка);

КонецПроцедуры

#КонецОбласти
