Процедура Все() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.ВсеОшибки);
КонецПроцедуры
Процедура Прочая() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.ПрочаяОшибка);
КонецПроцедуры
Процедура Компиляция() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаКомпиляцииВстроенногоЯзыка);
КонецПроцедуры
Процедура Выполнение() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаВоВремяВыполненияВстроенногоЯзыка);
КонецПроцедуры
Процедура ВызванноеИсключение() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.ИсключениеВызванноеИзВстроенногоЯзыка);
КонецПроцедуры
Procedure English() Export
    Raise("Text", ErrorCategory.AllErrors);
EndProcedure
Procedure EnglishOther() Export
    Raise("Text", ErrorCategory.OtherError);
EndProcedure
Procedure EnglishCompile() Export
    Raise("Text", ErrorCategory.ScriptCompileError);
EndProcedure
Procedure EnglishRuntime() Export
    Raise("Text", ErrorCategory.ScriptRuntimeError);
EndProcedure
Процедура Разрешено() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.ОшибкаКонфигурации);
КонецПроцедуры
Процедура Скобки() Экспорт
    ВызватьИсключение("Текст", (КатегорияОшибки.ВсеОшибки));
КонецПроцедуры
Процедура Переменная() Экспорт
    Категория = КатегорияОшибки.ВсеОшибки;
    ВызватьИсключение("Текст", Категория);
КонецПроцедуры
Процедура Чужой(Объект) Экспорт
    ВызватьИсключение("Текст", Объект.ВсеОшибки);
КонецПроцедуры
Процедура Затенение(КатегорияОшибки) Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.ВсеОшибки);
КонецПроцедуры
Procedure PlatformSpelling() Export
    Raise("Text", ErrorCategory.ExceptionRaisedFromScript);
EndProcedure
Процедура Простой() Экспорт
    ВызватьИсключение "Текст";
КонецПроцедуры
