Procedure MixedCase() Export
    Raise("Text", eRrOrCaTeGoRy.aLlErRoRs);
EndProcedure
Процедура Многострочно() Экспорт
    ВызватьИсключение("Текст",
        КатегорияОшибки.ПрочаяОшибка);
КонецПроцедуры
Процедура СКомментариями() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки. // категория
        ВсеОшибки);
КонецПроцедуры
Процедура ДругойАргумент() Экспорт
    ВызватьИсключение(КатегорияОшибки.ВсеОшибки);
КонецПроцедуры
Процедура Неизвестная() Экспорт
    ВызватьИсключение("Текст", КатегорияОшибки.НетТакойКатегории);
КонецПроцедуры
Процедура БольшеСкобок() Экспорт
    ВызватьИсключение("Текст", ((КатегорияОшибки.ВсеОшибки)));
КонецПроцедуры
Procedure Shadow(ErrorCategory) Export
    Raise("Text", ErrorCategory.AllErrors);
EndProcedure
ВызватьИсключение("Текст", КатегорияОшибки.ВсеОшибки);
