Процедура СложныйМетод(Знач А, Знач Б)

	Если А > 0 Тогда
		Если Б > 0 Тогда
			Если А > Б Тогда
				Если Б > 1 Тогда
					Если А > 1 Тогда
						Если Б > 2 Тогда
							Если А > 2 Тогда
								Если Б > 3 Тогда
									Если А > 3 Тогда
										Если Б > 4 Тогда
											Если А > 4 Тогда
												Если Б > 5 Тогда
													Б = Б + 1;
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
