Процедура Проверка(Неизвестно)
    Флаг = (Неизвестно = 1);
    Если Флаг = Истина Тогда
        Сообщить(Флаг);
    КонецЕсли;
    Если Ложь <> Флаг Тогда
        Сообщить(Флаг);
    КонецЕсли;
    Если Истина = Ложь Тогда
        Сообщить(Флаг);
    КонецЕсли;
    Если Неизвестно = Истина Тогда
        Сообщить(Неизвестно);
    КонецЕсли;
    Смешанное = ?(Неизвестно, Истина, "Нет");
    Если Смешанное = Истина Тогда
        Сообщить(Смешанное);
    КонецЕсли;
    Если ЗначениеЗаполнено(Неизвестно) = Ложь Тогда
        Сообщить(Неизвестно);
    КонецЕсли;
КонецПроцедуры

Результат = Истина = Ложь;
