Процедура СложныйМетод(Знач А, Знач Б)

	Если А > 1 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 2 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 3 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 4 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 5 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 6 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 7 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 8 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 9 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 10 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 11 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 12 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 13 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 14 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 15 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 16 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 17 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 18 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 19 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 20 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 21 Тогда
		Б = Б + 1;
	КонецЕсли;
	Если А > 22 Тогда
		Б = Б + 1;
	КонецЕсли;

КонецПроцедуры
