Процедура ПриЗаписи(Отказ)
    Если "ОбменДанными.Загрузка" = "только текст" Тогда
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    Если Не Проверить("DataExchange.Load") Тогда
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
    Если Не ОбменДанными.Загрузка Тогда
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры

Процедура BeforeWrite(Cancel)
    If Not customloadcheck() Then
        Cancel = True;
    EndIf;
КонецПроцедуры

Функция customloadcheck()
    Возврат Истина;
КонецФункции

Функция Проверить(Текст)
    Возврат Истина;
КонецФункции
