Процедура Проверка(Флаг, Объект)
    УстановитьБезопасныйРежим(Ложь);
    УстановитьБезопасныйРежим(Флаг);
    УстановитьБезопасныйРежим(Истина);
    УстановитьОтключениеБезопасногоРежима(Истина);
    УстановитьОтключениеБезопасногоРежима(Флаг);
    УстановитьОтключениеБезопасногоРежима(Ложь);
    SetSafeMode(False);
    SetSafeModeDisabled(True);
    Объект.УстановитьБезопасныйРежим(Ложь);
    Текст = "УстановитьБезопасныйРежим(Ложь)";
    УстановитьБезопасныйРежим();
    УстановитьБезопасныйРежим(Истина, Флаг);
КонецПроцедуры

УстановитьБезопасныйРежим(Ложь);
