Процедура Проверка(А, Б, Отказ, НеЛитерал, Значение, Таблица)
    Если Не Таблица.Найти(Значение, "Колонка") <> Неопределено Тогда // violation
        Сообщить(Значение);
    КонецЕсли;
    Результат = Не Отказ <> Ложь; // violation
    Результат = Не (Отказ <> Ложь); // violation
    Результат = Не НекотороеЗначение() <> Неопределено; // violation
    Результат = Не Неопределено <> НекотороеЗначение(); // violation
    Результат = Не (А <> Неопределено); // violation
    Результат = Не А <> Неопределено И Б = 5; // violation
    Результат = Не (А <> Неопределено И Б = 5);
    Результат = Не (А <> Неопределено Или Б = 5);
    Результат = Не (Б = 5 И А <> Неопределено);
    Пока Не Таблица.Данные <> Неопределено Цикл // violation
        Прервать;
    КонецЦикла;
    Результат = Не (Не А = 1 Или Б <> Неопределено);
    Результат = Не (А <> 1 Или Не Б <> Неопределено); // violation
    Результат = Не (А <> 1 Или Не Б = Неопределено);
    Если Не Таблица.Найти(Значение) = Неопределено Тогда
        Сообщить(Значение);
    КонецЕсли;
    Результат = Не (Отказ <> НеЛитерал); // violation
    Результат = Не СложнаяФункция() <> НеЛитерал; // violation
    Результат = Не (А = 1 Или Б <> НеЛитерал);
    Результат = Не (Не Значение); // violation
    Результат = Не (Не Значение И Б);
    Результат = Not (Not Значение); // violation
    Результат = Not А <> 0; // violation
    Результат = Не ((А <> 0)); // violation
КонецПроцедуры
