Процедура Проверка(Значение)
    Если Значение = 1 Тогда
        Сообщить(Значение);
    ИначеЕсли значение=1 Тогда
        Сообщить(Значение);
    КонецЕсли;
    Если Значение = "ABC" Тогда
        Сообщить(Значение);
    ИначеЕсли значение = "abc" Тогда
        Сообщить(Значение);
    КонецЕсли;
    Если Значение = "A  B" Тогда
        Сообщить(Значение);
    ИначеЕсли Значение = "A B" Тогда
        Сообщить(Значение);
    КонецЕсли;
    Если Значение = 2 Тогда
        Сообщить(Значение);
    ИначеЕсли значение = // Комментарий.
        2 Тогда
        Сообщить(Значение);
    КонецЕсли;
КонецПроцедуры
