Процедура Проверка(А, Б)
    Если А Тогда
    ИначеЕсли Б Тогда
        // Только в ИначеЕсли.
    Иначе
        // Только в Иначе.
    КонецЕсли;
    Пока А Цикл
        // Комментарий цикла.
    КонецЦикла;
    Попытка
    Исключение
        // Комментарий исключения не заполняет Попытку.
    КонецПопытки;
    Если А Тогда
        Если Б Тогда
            Сообщить("// Это строка");
        Иначе
            Сообщить(Б);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

Процедура ПустойМетод()
КонецПроцедуры
