Процедура ЗаполненныеБлоки(Параметр)

	Если Параметр Тогда
		Параметр = 1;
	ИначеЕсли Параметр = 2 Тогда
		Параметр = 2;
	Иначе
		Параметр = 3;
	КонецЕсли;

	Пока Параметр > 0 Цикл
		Параметр = Параметр - 1;
	КонецЦикла;

	Для Счётчик = 0 По 10 Цикл
		Параметр = Счётчик;
	КонецЦикла;

	Для Каждого Элемент Из Параметр Цикл
		Сообщить(Элемент);
	КонецЦикла;

	// Пустое Исключение не флагуется этой проверкой - своя проверка
	Попытка
		Параметр = 0;
	Исключение

	КонецПопытки;

КонецПроцедуры

Процедура ПустаяПроцедура()

КонецПроцедуры
