Процедура Проверка(А, Б)
    Результат = Не (А = А);
    Результат = Not (А <> А);
    Результат = Не (Не (А = А));
    Результат = Не (А И А);
    Результат = Не (А Или А);
    Результат = Не (А = Б);
    Результат = Не (А И Б);
    Результат = Не (А Или Б);
    Результат = Не (А + А);
    Результат = Не (А * А);
    Результат = Не (60 / 60);
    Результат = Проверить("Не (А = А)");
    // Не (А = А) — только комментарий.
КонецПроцедуры

Функция Проверить(Текст)
    Возврат Истина;
КонецФункции
