Процедура Проверка(А, Б, Динамический, Объект)
    Результат = СтрШаблон("%1");
    Результат = СтрШаблон("%1 %2", А);
    Результат = СтрШаблон("%11", А);
    Результат = СтрШаблон("%0", А);
    Результат = СтрШаблон("%2", А, Б);
    Результат = СтрШаблон("Текст", А);
    Результат = СтрШаблон("%(1)");
    Результат = СтрШаблон(НСтр("ru='%1'", А));
    Результат = СтрШаблон("%1 %1", А);
    Результат = СтрШаблон("%(1)45", А);
    Результат = СтрШаблон("%%1");
    Результат = СтрШаблон("%%%1%%", А);
    Результат = СтрШаблон(НСтр("ru='%1'"), А);
    Результат = СтрШаблон(Динамический, А);
    Результат = СтрШаблон("%1" + Динамический, А);
    Результат = СтрШаблон("", А);
    Результат = Объект.СтрШаблон("%1");
    Результат = StrTemplate("%(11)", А);
    Шаблон = "%1 %2";
    Результат = СтрШаблон(Шаблон, А);
    Шаблон = "%1";
    Результат = СтрШаблон(Шаблон, А);
    Результат = СтрШаблон("%1 %2 %3 %4 %5 %6 %7 %8 %9 %10", А, А, А, А, А, А, А, А, А, А);
КонецПроцедуры

РезультатМодуля = СтрШаблон("%1");
