Функция КомпактнаяФункция(Параметр)

Результат = Параметр;
Результат = Результат + 1;
Результат = Результат + 2;
Результат = Результат + 3;
Результат = Результат + 4;
Результат = Результат + 5;
Результат = Результат + 6;
Результат = Результат + 7;
Результат = Результат + 8;
Результат = Результат + 9;
Результат = Результат + 10;
Результат = Результат + 11;
Результат = Результат + 12;
Результат = Результат + 13;
Результат = Результат + 14;
Результат = Результат + 15;
Результат = Результат + 16;
Результат = Результат + 17;
Результат = Результат + 18;
Результат = Результат + 19;
Результат = Результат + 20;
Результат = Результат + 21;
Результат = Результат + 22;
Результат = Результат + 23;
Результат = Результат + 24;
Результат = Результат + 25;
Результат = Результат + 26;
Результат = Результат + 27;
Результат = Результат + 28;
Результат = Результат + 29;
Результат = Результат + 30;
Результат = Результат + 31;
Результат = Результат + 32;
Результат = Результат + 33;
Результат = Результат + 34;
Результат = Результат + 35;
Результат = Результат + 36;
Результат = Результат + 37;
Результат = Результат + 38;
Результат = Результат + 39;
Результат = Результат + 40;

Возврат Результат;

КонецФункции
