Функция СерверныйМодульМенеджера(Имя)
    ОбъектНайден = Ложь;
    ЧастиИмени = СтрРазделить(Имя, ".");
    Если ЧастиИмени.Количество() = 2 Тогда
        ИмяВида = ВРег(ЧастиИмени[0]);
        ИмяОбъекта = ЧастиИмени[1];
        Если ИмяВида = ВРег("Константы") Тогда
            Если Метаданные.Константы.Найти(ИмяОбъекта) <> Неопределено Тогда
                ОбъектНайден = Истина;
            КонецЕсли;
        ИначеЕсли ИмяВида = ВРег("РегистрыСведений") Тогда
            Если Метаданные.РегистрыСведений.Найти(ИмяОбъекта) <> Неопределено Тогда
                ОбъектНайден = Истина;
            КонецЕсли;
        Иначе
            ОбъектНайден = Ложь;
        КонецЕсли;
    КонецЕсли;
    Если Не ОбъектНайден Тогда
        ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Объект %1 не найден'"), Имя);
    КонецЕсли;
    УстановитьБезопасныйРежим(Истина);
    Модуль = Вычислить(Имя);
    Ф = ?(Условие, Истина, Неопределено);
    А = ?(Условие, Истина, ?(Условие2, Ложь, Неопределено));
    М = Истина Или 7;
    Возврат Модуль;
КонецФункции

Процедура СЦиклами()
    Для Ит = 0 По 4 Цикл
        Если Ит = 1 Тогда
            Сообщить(1);
            Прервать;
        Иначе
            Сообщить(2);
        КонецЕсли;
        Если Истина Или Ложь Тогда
            Сообщить(3);
        КонецЕсли;
        Для Каждого Строка Из Строки Цикл
            Если 1 > 0 Или 3 < 4 Или Не Истина Тогда
                Возврат;
            КонецЕсли;
            Продолжить;
        КонецЦикла;
    КонецЦикла;
    Перейти ~Метка;
    ~Метка: ;
КонецПроцедуры

Процедура Пустая()
КонецПроцедуры

&НаСервере
Процедура ТестСАннотацией()
    Если Условие Тогда
        Если Условие2 Тогда
        КонецЕсли;
    Иначе
        Для Каждого Элемент Из Коллекция Цикл
            Попытка
                Действие();
            Исключение
                Если Условие3 Или Условие4 Или Условие5 Или Условие6 Или Условие7 Тогда
                    Действие2();
                КонецЕсли;
            КонецПопытки;
        КонецЦикла;
    КонецЕсли;
    Для Каждого Строка Из Строки Цикл
        Если 1 > 0 Или 3 < 4 Или Не Истина Тогда
            Возврат;
        КонецЕсли;
        Продолжить;
    КонецЦикла;
КонецПроцедуры
