Процедура СерияИ(А, Б, В)
    Если А И Б И В Тогда
        Сообщить(А);
    КонецЕсли;
КонецПроцедуры

Процедура СИначе(А)
    Если А Тогда
        Сообщить(А);
    Иначе
    КонецЕсли;
КонецПроцедуры

Процедура СИсключением()
    Попытка
        Сообщить("Попытка");
    Исключение
        Сообщить("Исключение");
    КонецПопытки;
КонецПроцедуры

Процедура Рекурсия(А)
    Рекурсия(А);
КонецПроцедуры

Процедура Тернарник(А)
    Результат = ?(А, 1, 2);
КонецПроцедуры

Процедура ГибриднаяВетвь(А, Б)
    Если А Тогда
        Если Б Тогда
            Сообщить(А);
        ИначеЕсли А Тогда
            Сообщить(Б);
        Иначе
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

Если Истина Тогда
    Сообщить("Тело модуля");
Иначе
КонецЕсли;
