Процедура ВложенныеВызовы(Первое, Второе, Третье)
    Результат = Метод(ДругойМетод(Первое И Второе И Третье));
    Результат = Объект.Метод(Первое Или Второе Или Третье);
КонецПроцедуры

Процедура УсловияАргументов(Первое, Второе)
    Результат = Метод(?(Первое, 1, 2), ?(Второе, 3, 4));
КонецПроцедуры

Процедура РекурсивныйВызов(Первое, Второе)
    Результат = Объект.Метод(РекурсивныйВызов(Первое И Второе));
КонецПроцедуры

Процедура ЛогикаВИндексе(Первое, Второе)
    Результат = Коллекция[?(Первое И Второе, 1, 2)];
КонецПроцедуры
