Процедура ВетвиПрепроцессора(Первое, Второе)
#Если Сервер Тогда
    Если Первое Тогда
        Пока Второе Цикл
            Сообщить(Первое);
        КонецЦикла;
    КонецЕсли;
#Иначе
    Если Второе Тогда
        Сообщить(Второе);
    КонецЕсли;
#КонецЕсли
КонецПроцедуры

Процедура БлокПодМеткой(Первое, Второе)
    ~Начало: Пока Первое Цикл
        Если Второе Тогда
            Сообщить(Второе);
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

#Если Сервер Тогда
Если Истина Тогда
    Сообщить("Тело");
КонецЕсли;
#КонецЕсли
