Процедура Проверка(А)
    Результат = Новый Структура("Поле", Новый Структура("Ключ", А));
    Результат = Новый Структура("Поле", Новый Структура);
    Результат = Новый Структура("Поле", Новый Массив());
    Результат = Новый Структура("Поле", Обработать(Новый Структура("Ключ", А)));
    Результат = Новый Структура(Новый ФиксированнаяСтруктура(А));
    Результат = New Structure("Field", New Array(10));
КонецПроцедуры

Процедура Комментарий(А)
    Результат = Новый Структура("Поле",
        // Комментарий перед прямым аргументом.
        Новый Массив(А));
    Результат = Новый Структура("Поле", (Новый Массив(А)));
    Результат = Новый Структура("Поле", Новый Массив());
КонецПроцедуры

РезультатМодуля = Новый Структура("Поле", Новый Структура("Ключ"));
