Процедура Проверка(Первое, Второе)
    Если Первое Тогда
#Область Внутренняя
        Если Второе Тогда
            Сообщить(Второе);
        КонецЕсли;
#КонецОбласти
        Если Первое Тогда
            Сообщить(Первое);
        КонецЕсли;
#Если Сервер Тогда
        Если Второе Тогда
            Сообщить(Второе);
        КонецЕсли;
#Иначе
        Если Первое Тогда
            Сообщить(Первое);
        КонецЕсли;
#КонецЕсли
        Если Второе Тогда
            Сообщить(Второе);
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
