Процедура ЧтениеВВызове(Знач Параметр)
    Сообщить(Параметр);
    Параметр = 12;
КонецПроцедуры

Процедура ЧтениеВУсловии(Знач Параметр)
    Если Параметр Тогда
        Сообщить("Использован");
    КонецЕсли;
    Параметр = 12;
КонецПроцедуры

Процедура КореньПравойЧасти(Знач Параметр)
    Копия = Параметр;
    Параметр = 12;
КонецПроцедуры

Процедура ЧтениеОбъекта(Знач Параметр)
    Параметр.Значение = 10;
    Параметр = 12;
КонецПроцедуры

Процедура ИзменениеЗначения(Знач Параметр)
    Параметр = Параметр + 1;
    Параметр = 12;
КонецПроцедуры

Процедура ЧтениеВЦикле(Знач Параметр)
    Пока Параметр Цикл
        Прервать;
    КонецЦикла;
    Параметр = 12;
КонецПроцедуры

Процедура МетодСТемЖеИменем(Знач Сообщить)
    Сообщить("Это вызов метода, а не чтение параметра");
    Сообщить = 12;
КонецПроцедуры
