Функция БулевРезультат(А)
    Если А Тогда
        Возврат Истина;
    КонецЕсли;
    Возврат Истина;
КонецФункции

Функция СтроковыйРезультат(А)
    Если А Тогда
        Возврат "Значение";
    КонецЕсли;
    Возврат "значение";
КонецФункции

Функция Подключаемый_Пример(А)
    Если А Тогда
        Возврат 1;
    КонецЕсли;
    Возврат 1;
КонецФункции

Функция Переменная(А)
    Если А Тогда
        Возврат А;
    КонецЕсли;
    Возврат А;
КонецФункции

Функция Разные(А)
    Если А Тогда
        Возврат 1;
    КонецЕсли;
    Возврат 2;
КонецФункции

Функция Единственный()
    Возврат 1;
КонецФункции
