Функция ЧислоСоЗнаком(А)
    Если А Тогда
        Возврат -1;
    КонецЕсли;
    Возврат -1;
КонецФункции

Функция Выражение(А)
    Если А Тогда
        Возврат 1 + 2;
    КонецЕсли;
    Возврат 1 + 2;
КонецФункции

Функция Вызов(А)
    Если А Тогда
        Возврат ТекущаяДата();
    КонецЕсли;
    Возврат ТекущаяДата();
КонецФункции

Функция СПустымВозвратом(А)
    Если А Тогда
        Возврат;
    КонецЕсли;
    Возврат Истина;
КонецФункции

Function Attachable_Example(A)
    If A Then
        Return Null;
    EndIf;
    Return NULL;
EndFunction
