Процедура Проверка(Условие, Объект)
    Если БезопасныйРежим() Тогда
    ИначеЕсли Не SafeMode() Тогда
    КонецЕсли;
    Флаг = Условие И (Условие Или БезопасныйРежим());
    Флаг = Условие И (БезопасныйРежим() Или Условие);
    Флаг = Не БезопасныйРежим();
    Если БезопасныйРежим() <> Ложь Тогда
    КонецЕсли;
    Флаг = Условие И (БезопасныйРежим() = Истина);
    Флаг = БезопасныйРежим();
    Сообщить(БезопасныйРежим());
    Если Объект.БезопасныйРежим() Тогда
    КонецЕсли;
    Пока БезопасныйРежим() Цикл
        Прервать;
    КонецЦикла;
КонецПроцедуры

Если SafeMode() Тогда
КонецЕсли;
