Процедура Тест()
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПриходнаяНакладная");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СсылкаДляОбработки);
	
КонецПроцедуры

Процедура Тест2()
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Номенклатура");
	
	ЗаблокироватьДанныеСправочника(Блокировка);
	
КонецПроцедуры
