Процедура Тест()
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Документ.ПриходнаяНакладная");
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

Процедура Тест2()
	
	Блокировка = Новый БлокировкаДанных;
	
КонецПроцедуры

Процедура Тест3()
	
	Таблица = Новый ТаблицаЗначений;
	Строка = Таблица.Добавить();
	
КонецПроцедуры

Процедура Тест4()
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.Номенклатура");
	Блокировка.Заблокировать();
	
КонецПроцедуры
