// Устарела. Следует использовать новую (см. CommonModule.АктуальнаяФункция).
Функция УстаревшаяСсылаетсяНаАктуальную() Экспорт

	Возврат Истина;

КонецФункции

// Устарела. Следует использовать новую (см. CommonModule.ДругаяУстаревшаяФункция).
Функция УстаревшаяСсылаетсяНаУстаревшую() Экспорт

	Возврат Истина;

КонецФункции

// Устарела. Следует использовать новую (см.
// CommonModule.ДругаяУстаревшаяФункция).
Функция УстаревшаяСМногострочнойСсылкой() Экспорт

	Возврат Истина;

КонецФункции

// Устарела. Оставлена для обратной совместимости.
Функция ДругаяУстаревшаяФункция() Экспорт

	Возврат Истина;

КонецФункции

// Актуальная функция-замена.
Функция АктуальнаяФункция() Экспорт

	Возврат Истина;

КонецФункции
