// Устарела. Следует использовать новую (см. CommonModule.НесуществующаяФункция).
Функция УстаревшаяСсылаетсяНаНесуществующую() Экспорт

	Возврат Истина;

КонецФункции

// Устарела. Следует использовать новую (см. НесуществующийМодуль.Функция).
Функция УстаревшаяСсылаетсяНаНесуществующийМодуль() Экспорт

	Возврат Истина;

КонецФункции

// Устарела. Следует использовать новую (см. CommonModule.АктуальнаяФункция).
Функция УстаревшаяСсылаетсяНаАктуальную() Экспорт

	Возврат Истина;

КонецФункции

// Актуальная функция-замена.
Функция АктуальнаяФункция() Экспорт

	Возврат Истина;

КонецФункции
