Перем ПолеМодуля;

Процедура Проверка(Коллекция)
    Для Каждого НеИспользуется Из Коллекция Цикл
        Сообщить("НеИспользуется");
    КонецЦикла;
    Для Каждого Используется Из Коллекция Цикл
        Сообщить(используется);
    КонецЦикла;
    Для Каждого Присваивается Из Коллекция Цикл
        Присваивается = 1;
    КонецЦикла;
    Для Каждого Объект Из Коллекция Цикл
        Объект.Свойство = 1;
    КонецЦикла;
    Для Каждого ПолеМодуля Из Коллекция Цикл
        Сообщить("Текст");
    КонецЦикла;
    Для Каждого Сообщить Из Коллекция Цикл
        Сообщить("Вызов метода не читает итератор");
    КонецЦикла;
КонецПроцедуры

Для Каждого ИтераторМодуля Из Коллекция Цикл
    Сообщить("Текст");
КонецЦикла;
